-- ----------------------------
-- Table structure for dish
-- ----------------------------
DROP TABLE IF EXISTS "public"."dish";
CREATE TABLE "public"."dish" (
  "id" int8 NOT NULL,
  "name" varchar(64) COLLATE "pg_catalog"."default" NOT NULL,
  "category_id" int8 NOT NULL,
  "price" numeric(10,2) NOT NULL,
  "code" varchar(64) COLLATE "pg_catalog"."default" NOT NULL,
  "image" varchar(200) COLLATE "pg_catalog"."default" NOT NULL,
  "description" varchar(400) COLLATE "pg_catalog"."default",
  "status" int4 NOT NULL,
  "sort" int4 NOT NULL,
  "created_time" timestamp(6) NOT NULL,
  "updated_time" timestamp(6) NOT NULL,
  "created_user" int8 NOT NULL,
  "updated_user" int8 NOT NULL,
  "is_deleted" varchar(7) COLLATE "pg_catalog"."default" NOT NULL
)
;
COMMENT ON COLUMN "public"."dish"."id" IS '主鍵';
COMMENT ON COLUMN "public"."dish"."name" IS '菜品名稱';
COMMENT ON COLUMN "public"."dish"."category_id" IS '菜品分類ID';
COMMENT ON COLUMN "public"."dish"."price" IS '菜品價格';
COMMENT ON COLUMN "public"."dish"."code" IS '商品碼';
COMMENT ON COLUMN "public"."dish"."image" IS '圖片';
COMMENT ON COLUMN "public"."dish"."description" IS '描述信息';
COMMENT ON COLUMN "public"."dish"."status" IS '0:停售，1:起售';
COMMENT ON COLUMN "public"."dish"."sort" IS '順序';
COMMENT ON COLUMN "public"."dish"."created_time" IS '創建時間';
COMMENT ON COLUMN "public"."dish"."updated_time" IS '更新時間';
COMMENT ON COLUMN "public"."dish"."created_user" IS '創建人';
COMMENT ON COLUMN "public"."dish"."updated_user" IS '修改者';
COMMENT ON COLUMN "public"."dish"."is_deleted" IS '邏輯刪除字段';
COMMENT ON TABLE "public"."dish" IS '菜品管理';

-- ----------------------------
-- Records of dish
-- ----------------------------
INSERT INTO "public"."dish" VALUES (1595968323358306306, '宮保鷄丁', 1397844303408574465, 73500.00, '', '64d030ec-dd7f-4d7c-8dc2-3f23d5e5c28b.jpg', '本菜品麻辣鮮香，吃上一口回味無窮。', 1, 0, '2022-11-25 11:31:15', '2022-11-25 17:23:36', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1413342036832100354, '啤酒', 1413341197421846529, 500.00, '', 'ee36cf9d-0daa-44c9-a997-cf6b2dfd1154.png', '', 1, 0, '2021-07-09 11:39:35', '2022-11-25 17:32:30', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397850140982161409, '紅燒肉', 1397844263642378242, 6800.00, '123412341234', '1875af12-c38b-43c9-a21f-7a38ee54e79d.jpg', '毛氏红烧肉毛氏红烧肉，确定不来一份？', 1, 0, '2021-05-27 09:40:19', '2022-11-25 17:40:21', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397850392090947585, '魚翅', 1397844263642378242, 4800.00, '123412341234', '9a543e63-13cc-475e-9a2d-53049f5bddf8.jpg', '组庵鱼翅，看图足以表明好吃程度', 1, 0, '2021-05-27 09:41:19', '2022-11-25 17:41:58', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397851099502260226, '湘菜全家福', 1397844263642378242, 11800.00, '23412341234', 'bba79b48-2137-4ddc-b5f1-d44d9c440ba4.jpg', '别光吃肉啦，来份全家福吧，让你长寿又美味', 1, 0, '2021-05-27 09:44:08', '2022-11-25 17:39:48', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397851370462687234, '豬血丸子', 1397844263642378242, 13800.00, '1246812345678', '91713196-6b95-4a30-89a0-8dee412da8b7.jpg', '看，美味不？来嘛来嘛，这才是最爱吖', 1, 0, '2021-05-27 09:45:12', '2022-11-25 17:39:34', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397851668262465537, '口味蛇', 1397844263642378242, 16800.00, '1234567812345678', '16e0c423-9d12-4774-96e9-706ab897e4ed.jpg', '爬行界的扛把子，东兴-口味蛇，让你欲罢不能', 1, 0, '2021-05-27 09:46:23', '2022-11-25 17:39:25', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397852391150759938, '辣子鷄丁', 1397844303408574465, 8800.00, '2346812468', '4b2745d4-3849-4e86-859e-1ce00d1ef4ba.jpg', '辣子鸡丁，辣子鸡丁，永远的魂', 1, 0, '2021-05-27 09:49:16', '2022-11-25 17:39:07', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397853183287013378, '麻辣兔頭', 1397844303408574465, 19800.00, '123456787654321', '6024e988-7078-4d31-8956-57184d7112eb.jpg', '麻辣兔头的详细制作，麻辣鲜香，色泽红润，回味悠长', 1, 0, '2021-05-27 09:52:24', '2022-11-25 17:38:54', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397853709101740034, '蒜泥白肉', 1397844303408574465, 9800.00, '1234321234321', '47b71aca-2361-43de-9487-a6b8ee868f7a.jpg', '多么的有食欲啊', 1, 0, '2021-05-27 09:54:30', '2022-11-25 17:38:39', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397854652581064706, '麻辣水煮魚', 1397844303408574465, 14800.00, '2345312·345321', '585e57df-32d0-4339-ab2e-2402fb1fe306.jpg', '鱼片是买的切好的鱼片，放几个虾，增加味道', 1, 0, '2021-05-27 09:58:15', '2022-11-25 17:44:30', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397854865672679425, '炒鷄蛋', 1397844303408574465, 2000.00, '23456431·23456', 'eeb0c2bc-ce4b-49c8-8078-b9bbeaa3caf9.jpg', '鱼香菜也是川味的特色。里面没有鱼却鱼香味', 1, 0, '2021-05-27 09:59:06', '2022-11-25 17:36:33', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397860242057375745, '燒鵝', 1397844391040167938, 12800.00, '123456786543213456', 'b878fcac-b97d-4c4b-adff-b78bb341994c.jpeg', '“广东烤鸭美而香，却胜烧鹅说古冈（今新会），燕瘦环肥各佳妙，君休偏重便宜坊”，可见烧鹅与烧鸭在粤菜之中已早负盛名。作为广州最普遍和最受欢迎的烧烤肉食，以它的“色泽金红，皮脆肉嫩，味香可口”的特色，在省城各大街小巷的烧卤店随处可见。', 1, 0, '2021-05-27 10:20:27', '2022-11-25 17:35:36', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397860578738352129, '白切鷄', 1397844391040167938, 11700.00, '12345678654', 'e494d7f1-2a1d-40bc-ad8f-144bc2e7f0e9.jpeg', '白切鸡是一道色香味俱全的特色传统名肴，又叫白斩鸡，是粤菜系鸡肴中的一种，始于清代的民间。白切鸡通常选用细骨农家鸡与沙姜、蒜茸等食材，慢火煮浸白切鸡皮爽肉滑，清淡鲜美。著名的泮溪酒家白切鸡，曾获商业部优质产品金鼎奖。湛江白切鸡更是驰名粤港澳。粤菜厨坛中，鸡的菜式有200余款之多，而最为人常食不厌的正是白切鸡，深受食家青睐。', 1, 0, '2021-05-27 10:21:48', '2022-11-25 17:34:53', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397860792492666881, '烤乳豬', 1397844391040167938, 38800.00, '213456432123456', 'c2e88bf9-afb4-467d-b6f6-60e8ae5051a2.jpeg', '广式烧乳猪主料是小乳猪，辅料是蒜，调料是五香粉、芝麻酱、八角粉等，本菜品主要通过将食材放入炭火中烧烤而成。烤乳猪是广州最著名的特色菜，并且是“满汉全席”中的主打菜肴之一。烤乳猪也是许多年来广东人祭祖的祭品之一，是家家都少不了的应节之物，用乳猪祭完先人后，亲戚们再聚餐食用。', 1, 0, '2021-05-27 10:22:39', '2022-11-25 17:35:45', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397861683434139649, '河鮮清蒸', 1397844391040167938, 38800.00, '1234567876543213456', 'cf8d7a35-2c72-49b7-a4c3-4db93967a0d8.jpg', '新鲜的海鲜，清蒸是最好的处理方式。鲜，体会为什么叫海鲜。清蒸是广州最经典的烹饪手法，过去岭南地区由于峻山大岭阻隔，交通不便，经济发展起步慢，自家打的鱼放在锅里煮了就吃，没有太多的讲究，但却发现这清淡的煮法能使鱼的鲜甜跃然舌尖。', 1, 0, '2021-05-27 10:26:11', '2022-11-25 17:43:40', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397862198033297410, '瓦罐煨湯', 1397844391040167938, 49800.00, '123456786532455', 'b4ea6d07-0746-4581-bab3-a0764dc44e57.jpeg', '老火靓汤又称广府汤，是广府人传承数千年的食补养生秘方，慢火煲煮的中华老火靓汤，火候足，时间长，既取药补之效，又取入口之甘甜。 广府老火汤种类繁多，可以用各种汤料和烹调方法，烹制出各种不同口味、不同功效的汤来。', 1, 0, '2021-05-27 10:28:14', '2022-11-25 17:34:00', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397862477831122945, '精品龍蝦', 1397844391040167938, 108800.00, '1234567865432', '7c6f97d4-7532-4561-b396-f5c1a74e2654.jpeg', '上汤焗龙虾是一道色香味俱全的传统名菜，属于粤菜系。此菜以龙虾为主料，配以高汤制成的一道海鲜美食。本品肉质洁白细嫩，味道鲜美，蛋白质含量高，脂肪含量低，营养丰富。是色香味俱全的传统名菜。', 1, 0, '2021-05-27 10:29:20', '2022-11-25 17:36:56', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1413385247889891330, '米飯', 1413384954989060097, 2000.00, '', '973a62d8-f111-4899-b472-d55a910f1267.png', '吃飽喝飽，長生不老。^尷尬^', 1, 0, '2021-07-09 14:31:17', '2022-11-25 17:31:28', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1413384757047271425, '王老吉', 1413341197421846529, 5000.00, '', '4bc78acb-248e-4873-bf18-0d5c082d3156.png', '怕上火就喝王老吉。', 1, 0, '2021-07-09 14:29:20', '2022-11-25 17:30:18', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397853890262118402, '魚香肉絲', 1397844303408574465, 3800.00, '1234212321234', '1574dc83-4c25-4653-89eb-a497644dd9c9.jpg', '鱼香肉丝简直就是我们童年回忆的一道经典菜，上学的时候点个鱼香肉丝盖饭坐在宿舍床上看着肥皂剧，绝了！现在完美复刻一下上学的时候感觉', 1, 0, '2021-05-27 09:55:13', '2022-11-25 17:41:13', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397860963880316929, '脆皮乳鴿', 1397844391040167938, 10800.00, '1234563212345', '5f8d4463-f31b-45be-8069-302d7b4d143b.jpeg', '“脆皮乳鸽”是广东菜中的一道传统名菜，属于粤菜系，具有皮脆肉嫩、色泽红亮、鲜香味美的特点，常吃可使身体强健，清肺顺气。随着菜品制作工艺的不断发展，逐渐形成了熟炸法、生炸法和烤制法三种制作方法。无论那种制作方法，都是在鸽子经过一系列的加工，挂脆皮水后再加工而成，正宗的“脆皮乳鸽皮脆肉嫩、色泽红亮、鲜香味美、香气馥郁。这三种方法的制作过程都不算复杂，但想达到理想的效果并不容易。', 1, 0, '2021-05-27 10:23:19', '2022-11-25 17:34:20', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397850851245600769, '霸王別姬', 1594870808064147458, 12800.00, '123412341234', '68ed228f-b49e-4984-b27f-cd0cb15f1969.jpeg', '还有什么比霸王别姬更美味的呢？', 1, 0, '2021-05-27 09:43:08', '2023-09-20 11:45:17.82551', 1, 1, 'visible');
INSERT INTO "public"."dish" VALUES (1397849739276890114, '辣子鷄', 1397844263642378242, 7800.00, '1234567', '8441c76e-e6b9-48ca-b1b3-4df0b0dd65fd.jpg', '来自鲜嫩美味的小鸡，值得一尝', 1, 0, '2021-05-27 09:38:43', '2023-09-20 11:45:17.8108', 1, 1, 'visible');

-- ----------------------------
-- Indexes structure for table dish
-- ----------------------------
CREATE UNIQUE INDEX "idx_dish_name" ON "public"."dish" USING btree (
  "name" COLLATE "pg_catalog"."default" "pg_catalog"."text_ops" ASC NULLS LAST
);

-- ----------------------------
-- Primary Key structure for table dish
-- ----------------------------
ALTER TABLE "public"."dish" ADD CONSTRAINT "dish_pkey" PRIMARY KEY ("id");
